{"_id":{"$oid":"6137a092c72b56de8a8cd690"},"Title":"Blade Runner","Description":"In the smog-choked dystopian Los Angeles of 2019, blade runner Rick Deckard is called out of retirement to terminate a quartet of replicants who have escaped to Earth seeking their creator for a way to extend their short life spans.","Genre":{"Name":"Sci-Fi","Description":"Science fiction is a genre of speculative fiction that typically deals with imaginative and futuristic concepts such as advanced science and technology, space exploration, time travel, parallel universes, and extraterrestrial life."},"Director":{"Name":"Ridley Scott","Bio":"Sir Ridley Scott is an English film director and producer. He has directed the science fiction horror film Alien (1979), the neo-noir dystopian film Blade Runner (1982), the road adventure film Thelma \u0026 Louise (1991), the historical drama film Gladiator (2000), the war film Black Hawk Down (2001), and the science fiction film The Martian (2015).","Birth":"1937"},"ImagePath":"bladerunner.png"}
{"_id":{"$oid":"6137a092c72b56de8a8cd691"},"Title":"Parasite","Description":"All unemployed, Ki-taek's family takes peculiar interest in the wealthy and glamorous Parks for their livelihood until they get entangled in an unexpected incident.","Genre":{"Name":"Thriller","Description":"Thriller film, also known as suspense film or suspense thriller, is a broad film genre that evokes excitement and suspense in the audience."},"Director":{"Name":"Bong Joon-ho","Bio":"Bong Joon-ho (Korean: 봉준호), born September 14, 1969, is a South Korean film director, producer and screenwriter. His films are characterised by emphasis on social themes, genre-mixing, black humor, and sudden tone shifts.","Birth":"1969"},"ImagePath":"parasite.png"}
{"_id":{"$oid":"6137a092c72b56de8a8cd692"},"Title":"Jurassic Park","Description":"A wealthy entrepreneur secretly creates a theme park featuring living dinosaurs drawn from prehistoric DNA. Before opening day, he invites a team of experts and his two eager grandchildren to experience the park and help calm anxious investors.","Genre":{"Name":"Action","Description":"Action film is a film genre in which the protagonist or protagonists are thrust into a series of events that typically include violence, extended fighting, physical feats, rescues and frantic chases."},"Director":{"Name":"Steven Spielberg","Bio":"One of the most influential personalities in the history of cinema, Steven Spielberg is Hollywood's best known director and one of the wealthiest filmmakers in the world.","Birth":"1946"},"ImagePath":"jurassicpark.png"}
{"_id":{"$oid":"6137a092c72b56de8a8cd693"},"Title":"The Social Network","Description":"In 2003, Harvard undergrad Mark Zuckerberg creates a social networking site called Facebook with the help of his friend Eduardo Saverin. Though it turns out to be a successful venture, he severs ties with several people along the way.","Genre":{"Name":"Drama","Description":"In film and television, drama is a category of narrative fiction (or semi-fiction) intended to be more serious than humorous in tone."},"Director":{"Name":"David Fincher","Bio":"David Andrew Leo Fincher (born August 28, 1962) is an American film director and music video director who is known for his dark and stylish thrillers, such as Seven (1995), The Game (1997), Fight Club (1999), Panic Room (2002), and Zodiac (2007).","Birth":"1962"},"ImagePath":"socialnetwork.png"}
{"_id":{"$oid":"6137a092c72b56de8a8cd694"},"Title":"The Lord of the Rings: Return of the King","Description":"Aragorn is revealed as the heir to the ancient kings as he, Gandalf and the other members of the broken fellowship struggle to save Gondor from Sauron's forces. Meanwhile, Frodo and Sam take the ring closer to the heart of Mordor, the dark lord's realm.","Genre":{"Name":"Fantasy","Description":"Fantasy is a genre of speculative fiction set in a fictional universe, often inspired by real world myth and folklore."},"Director":{"Name":"Peter Jackson","Bio":"Sir Peter Robert Jackson, (born 31 October 1961) is a New Zealand film director, producer, actor, and screenwriter, known for his Lord of the Rings film trilogy, adapted from the novel by J. R. R. Tolkien.","Birth":"1961"},"ImagePath":"returnoftheking.png"}
{"_id":{"$oid":"6137a092c72b56de8a8cd695"},"Title":"The Good, the Bad, and the Ugly","Description":"While the Civil War rages between the Union and the Confederacy, three men – a quiet loner, a ruthless hit man and a Mexican bandit – comb the American Southwest in search of a strongbox containing $200,000 in stolen gold.","Genre":{"Name":"Western","Description":"Western is a genre of fiction set primarily in the latter half of the 19th and early 20th century in the Western United States."},"Director":{"Name":"Sergio Leone","Bio":"Sergio Leone (January 3, 1929 – April 30, 1989) was an Italian film director, producer and screenwriter most associated with the Spaghetti Western genre.","Birth":"1929","Death":"1989"},"ImagePath":"goodbadugly.png"}
{"_id":{"$oid":"6137a092c72b56de8a8cd696"},"Title":"Jaws","Description":"When an insatiable great white shark terrorizes the townspeople of Amity Island, the police chief, an oceanographer and a grizzled shark hunter seek to destroy the blood-thirsty beast.","Genre":{"Name":"Thriller","Description":"Thriller film, also known as suspense film or suspense thriller, is a broad film genre that evokes excitement and suspense in the audience."},"Director":{"Name":"Steven Spielberg","Bio":"One of the most influential personalities in the history of cinema, Steven Spielberg is Hollywood's best known director and one of the wealthiest filmmakers in the world.","Birth":"1946"},"ImagePath":"jaws.png"}
{"_id":{"$oid":"6137a092c72b56de8a8cd697"},"Title":"Rear Window","Description":"A wheelchair-bound photographer spies on his neighbors from his apartment window and becomes convinced one of them has committed murder.","Genre":{"Name":"Thriller","Description":"Thriller film, also known as suspense film or suspense thriller, is a broad film genre that evokes excitement and suspense in the audience."},"Director":{"Name":"Alfred Hitchcock","Bio":"Sir Alfred Joseph Hitchcock, KBE (13 August 1899 – 29 April 1980) was an English director and producer. He pioneered many techniques in the suspense and psychological thriller genres.","Birth":"1899","Death":"1980"},"ImagePath":"rearwindow.png"}
{"_id":{"$oid":"6137a092c72b56de8a8cd698"},"Title":"Alien","Description":"In space, no one can hear you scream","Genre":{"Name":"Horror","Description":"A horror film is one that seeks to elicit fear or disgust in its audience for entertainment purposes.[1] Horror films additionally aim to evoke viewers' nightmares, revulsions and terror of the unknown or the macabre."},"Director":{"Name":"Ridley Scott","Bio":"Sir Ridley Scott is an English film director and producer. He has directed the science fiction horror film Alien (1979), the neo-noir dystopian film Blade Runner (1982), the road adventure film Thelma \u0026 Louise (1991), the historical drama film Gladiator (2000), the war film Black Hawk Down (2001), and the science fiction film The Martian (2015).","Birth":"1937"},"ImagePath":"alien.png"}
{"_id":{"$oid":"6137a092c72b56de8a8cd699"},"Title":"The Dark Knight","Description":"Batman raises the stakes in his war on crime. With the help of Lt. Jim Gordon and District Attorney Harvey Dent, Batman sets out to dismantle the remaining criminal organizations that plague the streets.","Genre":{"Name":"Action","Description":"Action film is a film genre in which the protagonist or protagonists are thrust into a series of events that typically include violence, extended fighting, physical feats, rescues and frantic chases."},"Director":{"Name":"Christopher Nolan","Bio":"Nolan is known for writing and directing critically acclaimed films such as Memento (2000), The Prestige (2006), The Dark Knight Trilogy (2005-12), Inception (2010), Interstellar (2014) and Dunkirk (2017).","Birth":"1970"},"ImagePath":"darkknight.png"}
